[
  {
    "title": "The coronation of Beast Mode",
    "order": "1",
    "rank": "1",
    "overlay": "",
    "subhead": "Jan. 8, 2011",
    "image": "marshawn1.jpg",
    "chatter": "<p>The true beginning of Beast Mode and everything that followed came with 3:22 left in a wild-card game against the New Orleans Saints, as a 7-9 Seahawks team tried to hang on to a win against the defending Super Bowl champs.<p>On first-and-10 from the Seattle 33-yard line, Lynch took a handoff and took off, cutting and weaving through the Saints secondary, breaking eight tackles and stiff-arming Tracy Porter en route to a 67-yard touchdown run. The run elicited an increasing roar from the CenturyLink Field crowd that registered on the Pacific Northwest Seismic Network's earthquake monitoring stations, creating a run with its own name that will live in Seahawks lore forever: Beast Quake.</p>",
    "credit": "",
    "linktext": "Seahawks upset Saints in wild-card playoff",
    "link": "http://www.seattletimes.com/sports/seahawks/seahawks-upset-saints-41-36/",
    "youtube": "H2P6TwZlh6A"
  },
  {
    "title": "Beast Quake 2.0",
    "order": "2",
    "rank": "2",
    "overlay": "",
    "subhead": "Dec. 21, 2014",
    "image": "marshawn2.jpg",
    "chatter": "<p>In what was almost an exact replica of the run against the Saints &mdash; minus the seismic activity &mdash; Lynch plowed through the Cardinals in Glendale, Arizona, for the longest run of his career, a 79-yard touchdown to cap a 35-6 win. Accompanied much of the way by good friend Ricardo Lockette, who blocked downfield for Beast Mode, Lynch bolwed over Patrick Peterson and Rashad Johnson before driving backward into the end zone with a flair uniquely his.</p>",
    "credit": "John Lok / The Seattle Times",
    "linktext": "Lynch's 79-yard TD run was sick",
    "link": "http://www.seattletimes.com/sports/seahawks/marshawn-lynchrsquos-79-yard-touchdown-run-was-sick/",
    "youtube": "RnTzBTrGlpw"
  },
  {
    "title": "Packer punch-out",
    "order": "3",
    "rank": "3",
    "overlay": "right",
    "subhead": "Jan. 18, 2015",
    "image": "marshawn3.jpg",
    "chatter": "<p>It might not have been as spectacular as some of his other runs. But Lynch's 24-yard touchdown with 1:25 left in the 2015 NFC Championship Game ranks as maybe the most important of his career.<p>The run came on first down after the Seahawks had recovered an onside kick and needed a touchdown to go ahead of the Packers. Lynch took a handoff on a zone read and cut back left and into the end zone, capping a day in which he rushed for 157 yards, a Seahawks playoff record.</p>",
    "credit": "Dean Rutz / The Seattle Times",
    "linktext": "9 biggest moments of 2014 NFCCG",
    "link": "http://blogs.seattletimes.com/seahawks/2015/01/18/the-9-biggest-moments-from-the-seahawks-comeback-win-over-the-packers-in-the-nfc-championship-game/",
    "youtube": "5ubbFDQwaPU"
  },
  {
    "title": "Cutback for the comeback",
    "order": "4",
    "rank": "4",
    "overlay": "right",
    "subhead": "Jan. 19, 2014",
    "image": "marshawn4.jpg",
    "chatter": "<p>Just about everything else in Seattle's 2014 NFC title game win over the 49ers was easily forgotten after Richard Sherman's tip that sealed the win. But the Seahawks might not have been in position to win if Lynch had not ripped off a 40-yard TD run with 9:51 to go in the third quarter that tied the score at 10-10 and jumpstarted the Seattle offense.<p>It was a trademark Lynch run in which he started right, then cut against the grain to the left and weaved his way back through traffic into the end zone. Lynch finished with 109 yards, one of six times in 10 playoff games with Seattle that he broke the century mark.</p>",
    "credit": "Dean Rutz / The Seattle Times",
    "linktext": "Seahawks beat 49ers to win NFC title",
    "link": "http://www.seattletimes.com/sports/seahawks/seahawks-win-nfc-title-beat-49ers-23-17/",
    "youtube": ""
  },
  {
    "title": "Running for Skittles",
    "order": "5",
    "rank": "5",
    "overlay": "right",
    "subhead": "Dec. 12, 2011",
    "image": "marshawn5.jpg",
    "chatter": "<p>It eventually just became a Marshawn Lynch canon that he loved Skittles. But no one really knew it until this game, a Thursday-night matchup against the Eagles in which Lynch rushed for a then-franchise-high 148 yards while battling an upset stomach. He ate Skittles on the sideline, TV cameras picked it up and Seahawks folklore was born. The first of his two touchdowns that game was also a uniquely Lynch run from the Eagles' 15. He took a handoff, ran into a huge pile then somehow bounched out of it and through the arms of linebacker Jamar Chaney into the end zone.</p>",
    "credit": "John Lok / The Seattle Times",
    "linktext": "Seahawks dominate Rams on 'MNF'",
    "link": "http://www.seattletimes.com/sports/seahawks/seahawks-dominate-rams-in-30-13-monday-night-victory/",
    "youtube": "uQ4XBxfE2oU"
  },
  {
    "title": "Holy Catfish!!!",
    "order": "6",
    "rank": "6",
    "overlay": "right",
    "subhead": "Sept. 29, 2013",
    "image": "marshawn6.jpg",
    "chatter": "<p>The first known recording of radio play-by-play broadcaster Steve Raible’s now-signature “Holy Catfish!’’ call was inspired by a 43-yard Lynch run at Houston in 2013. The Seahawks faced first-and-17 at their 2-yard line early in the game when Lynch plowed and juked his way down the right sideline. <p>Raible got particularly excited when Lynch escaped a diving lunge by Houston nose tackle Earl Mitchell at around the 25, reaching the 45 before he was tracked down by J.J. Watt. The run was the longest by any Seahawk during their Super Bowl-winning season.</p>",
    "credit": "John Lok / The Seattle Times",
    "linktext": "",
    "link": "",
    "youtube": "VTEW6bW6NP4"
  },
  {
    "title": "Another Saintly touchdown",
    "order": "7",
    "rank": "7",
    "overlay": "right",
    "subhead": "Jan. 11, 2014",
    "image": "marshawn7.jpg",
    "chatter": "<p>Two of Lynch’s six postseason 100-yard playoff games for Seattle came against the Saints. And though the Beast Quake game is by far more popular, Lynch’s 140 yards to spark a 23-15 divisional playoff win for Seattle on its way to the Super Bowl title was no less important. <p>The highlight was a 31-yard touchdown that put the game away with 2:40 remaining, in which Lynch stiff-armed New Orleans cornerback Keenan Lewis to break free down the sideline.</p>",
    "credit": "John Lok / The Seattle Times",
    "linktext": "",
    "link": "NENwascqZEU",
    "youtube": ""
  },
  {
    "title": "Winning in Washington",
    "order": "8",
    "rank": "8",
    "overlay": "",
    "subhead": "Jan. 6, 2013",
    "image": "marshawn8.jpg",
    "chatter": "<p>The template for the Carroll era was set during a wild-card playoff game at Washington, as the Seahawks fell behind 14-0 and rallied for a 24-14 win. Lynch was at the forefront of the comeback with 132 yards, tying the Seahawks’ postseason rushing record at the time. And he gave Seattle its first lead on 27-yard touchdown run with 7:08 left in which his juke past Washington cornerback DeAngelo Hall allowed him to get to the sideline and into the open.\n</p>",
    "credit": "John Lok / The Seattle Times",
    "linktext": "",
    "link": "",
    "youtube": ""
  },
  {
    "title": "A Skittles eruption following a streak-ender",
    "order": "9",
    "rank": "9",
    "overlay": "",
    "subhead": "Dec. 24, 2011",
    "image": "marshawn9.jpg",
    "chatter": "<p>Lynch’s 4-yard touchdown run in the fourth quarter against the 49ers wasn’t overly spectacular, other than for a streak it ended and a celebration it caused. The score was the first rushing touchdown allowed by the 49ers in 2011, ending a 14-game streak that had tied the 1985 Bears for the longest in the NFL since 1970. <p>Coming a few weeks after Lynch’s love for Skittles became widely known, it also caused Seahawks fans to douse the end zone with the candy, forcing stadium works to use blowers to clean up the field. The fans undoubtedly were inspired by Lynch’s shoes, which featured a Skittles graphic on the side (for which he was fined $10,000 by the NFL).</p>",
    "credit": "Dean Rutz / The Seattle Times",
    "linktext": "",
    "link": "",
    "youtube": ""
  },
  {
    "title": "Motoring in the Motor City",
    "order": "10",
    "rank": "10",
    "overlay": "",
    "subhead": "Oct. 28, 2012",
    "image": "marshawn10.jpg",
    "chatter": "<p>Most of Lynch’s memorable runs featured a fair share of tackle- and ankle-breaking along the way. But on what was his second-longest touchdown as a Seahawk --- a 77-yarder at Detroit --- he also showed he had underrated speed. <p>Lynch, lined up behind Michael Robinson in an I-formation, took a simple pitch out to the left and, using some good blocking at the line and a final block from Robinson, broke virtually untouched into the open and down the sideline for the longest run by a Seahawk since 2005.</p>",
    "credit": "Associated Press",
    "linktext": "",
    "link": "",
    "youtube": ""
  }
]
